<template>
  <div id="app">
    <div class="p-5">
      <h1>درباره ما</h1>
      <hr />
      <div class="row mt-2">
        <div class="col-lg-6 mt-5">
          <p class="textStyle">
            کتابخانۀ مرکزی و مرکز اسناد دانشگاه تهران بزرگترین کتابخانۀ دانشگاهی
            ایران است و مجموعه‌ای غنی وگسترده از منابع گوناگون در زمینه‌های
            مختلف علوم و فنون و ادب را در برمی‌گیرد . این کتابخانه در کنار
            کتابخانه‌های تخصصی دانشکده‌ها که هر یک برحسب نیازهای علمی و آموزشی
            ویژة خود به وجود آمده‌اند، بیشتر به امر پژوهش اختصاص دارد و به
            گردآوری آثار مربوط به مطالعات اسلام‌شناسی، ایران‌شناسی و شرق شناسی
            می‌پردازد.بنای فعلی کتابخانه، در یکم مهرماه سال 1350 گشایش یافت. در
            طول این مدت، امور فنی کتابخانه، ایجاد ارتباط با مراکز علمی و
            دانشگاهی جهان، انتخاب و به کار گماردن کتابداران متخصص، در زیرزمین
            سازمان مرکزی، و زیرزمین دانشکدة علوم و اتاق‌های مسجد دانشگاه انجام
            می‌شد .در سال 1353 ، به منظور گردآوری و نگهداری و سازمان‌دهی
            انتشارات غیرکتابی که از سازمان‌ها ، وزراتخانه‌ها ، دانشگاه‌ها و
            انجمن‌های فرهنگی و مؤسسات و مراکز داخل و خارج از کشور به کتابخانة
            مرکزی اهدا می‌شد ، «مرکز اسناد» کتابخانه دایر گشت و نام آن به
            کتابخانة مرکزی افزوده شد. ساختمان کتابخانه با مساحت بیش از 22000 متر
            مربع دارای نه طبقه است که شامل دو طبقه زیرزمین، همکف، طبقه اول و 5
            طبقه مخزن کتاب و مطبوعات و اسناد است .کتابخانه مرکزی و مرکز اسناد در
            حال حاضر حدود 50000 عضو ثابت دارد و روزانه پاسخگوی بیش از 4500 نفر
            مراجعه‌کننده از دانشجویان دانشگاه تهران و دیگر دانشگاه‌ها و مؤسسات
            آموزش عالی و محققان و پژوهشگران داخل و خارج از کشور است. کتابخانۀ
            مرکزی و مرکز اسناد از سال 1346 به عضویت فدراسیون بین المللی انجمنهای
            کتابداری - ایفلا- درآمده است.
          </p>
          <div>
            <button
              class="btn btn-success"
              style="border-radius: 15px"
              v-on:click="homeDirection"
            >
              صفحه اصلی
            </button>
          </div>
        </div>
        <div class="col-lg-6">
          <img
            style="margin-top: 30px; border-radius: 10%"
            src="../assets/pics/1.png"
            class="img-about"
          />
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import modal from "../components/modal.vue";

export default {
  name: "app",
  components: {
    modal,
  },
  data() {
    return {
      isModalVisible: false,
    };
  },
  methods: {
    showModal() {
      this.isModalVisible = true;
    },
    closeModal() {
      this.isModalVisible = false;
    },
    homeDirection() {
      this.$router.push("/");
    },
  },
};
</script>
<style>
.textStyle {
  font-size: 18px;
}
.img-about {
  height: 600px;
  width: 95%;
  filter: grayscale(1);
}
</style>
