<template>
  <div id="app">
     <div class="p-5">
      <h3>درباره ما</h3>
      <hr>
      <div class="row mt-2">
        <div class="col-lg-6 mt-5">
          <p class="">
            کتابخانۀ مرکزی و مرکز اسناد دانشگاه تهران بزرگترین کتابخانۀ دانشگاهی ایران است و مجموعه‌ای غنی وگسترده از منابع گوناگون در زمینه‌های مختلف علوم و فنون و ادب را در برمی‌گیرد . این کتابخانه در کنار کتابخانه‌های تخصصی دانشکده‌ها که هر یک برحسب نیازهای علمی و آموزشی ویژة خود به وجود آمده‌اند، بیشتر به امر پژوهش اختصاص دارد و به گردآوری آثار مربوط به مطالعات اسلام‌شناسی، ایران‌شناسی و شرق شناسی می‌پردازد. هستة اصلی کتابخانة مرکزی دانشگاه تهران در سال 1328 ، با مجموعۀ اهدایی سید محمد مشکوه، استاد دانشگاه تهران، شامل 1329 جلد نسخة خطی، تشکیل گردید. بنای فعلی کتابخانه، در یکم مهرماه سال 1350 گشایش یافت. در طول این مدت، امور فنی کتابخانه، ایجاد ارتباط با مراکز علمی و دانشگاهی جهان، انتخاب و به کار گماردن کتابداران متخصص، در زیرزمین سازمان مرکزی، و زیرزمین دانشکدة علوم و اتاق‌های مسجد دانشگاه انجام می‌شد .در سال 1353 ، به منظور گردآوری و نگهداری و سازمان‌دهی انتشارات غیرکتابی که از سازمان‌ها ، وزراتخانه‌ها ، دانشگاه‌ها و انجمن‌های فرهنگی و مؤسسات و مراکز داخل و خارج از کشور به کتابخانة مرکزی اهدا می‌شد ، «مرکز اسناد» کتابخانه دایر گشت و نام آن به کتابخانة مرکزی افزوده شد. ساختمان کتابخانه با مساحت بیش از 22000 متر مربع دارای نه طبقه است که شامل دو طبقه زیرزمین، همکف، طبقه اول و 5 طبقه مخزن کتاب و مطبوعات و اسناد است .کتابخانه مرکزی و مرکز اسناد در حال حاضر حدود 50000 عضو ثابت دارد و روزانه پاسخگوی بیش از 4500 نفر مراجعه‌کننده از دانشجویان دانشگاه تهران و دیگر دانشگاه‌ها و مؤسسات آموزش عالی و محققان و پژوهشگران داخل و خارج از کشور است. کتابخانۀ مرکزی و مرکز اسناد از سال 1346 به عضویت فدراسیون بین المللی انجمنهای کتابداری - ایفلا- درآمده است.
          </p>
          <div>
            <button class="btn btn-success" style="border-radius:30%">صفحه اصلی</button>
          </div>
        </div>
        <div class="col-lg-6">
          <img
          style="border-radius:10%"
            src="../assets/pics/1.png"
            class="img-about"
            alt=""
          />
        </div>
      </div>
    </div>
  </div>
</template>

<script>


export default {
  name: "app",
  data() {
    return {
      isModalVisible: false,
    };
  },
  methods: {
    showModal() {
      this.isModalVisible = true;
    },
    closeModal() {
      this.isModalVisible = false;
    },
  },
};
</script>
<style scoped>
.img-about {
  height: 500px;
  width: 100%;
  filter: grayscale(1);
}
</style>
